NAMA : IBNU GILANG PRADUTA CIPTA
NIM  :2209106040
KELAS A2

In [36]:
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import OrdinalEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split
import pandas as pd

input library yang akan kita pakai

In [37]:
ibnu = pd.read_csv('bank-full.csv')

masukkan dataset yang akan kita pakai

DATA SPLIT 70:30

In [38]:
ibnu.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [39]:
X = ibnu.drop(columns='duration')
y = ibnu['duration']

In [40]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [41]:
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(31647, 16)
(13564, 16)
(31647,)
(13564,)

melakukan data split, dan menentukan x dan y untuk training set dan testing set

STANDARISASI

In [42]:
ibnu1 = pd.read_csv("bank-full.csv")

masukkan dataset yang akan dipakai

In [43]:
slr = StandardScaler()
ibnu1[['age', 'duration', 'balance', 'day']] = slr.fit_transform(ibnu1[['age', 'duration', 'balance', 'day']])

melakukan standarisasi dengan integer dan float

NORMALISASI

In [44]:
mx = MinMaxScaler()
ibnu1[['age', 'duration', 'balance', 'day']] = mx.fit_transform(ibnu1[['age', 'duration', 'balance', 'day']])

In [45]:
ibnu1['age'].max()

1.0

In [46]:
ibnu1['age'].min()

0.0

menampilkan normalisasi dengan data integer dan float lalu tampilkan min dan max nya

DATA CLEANING PADA DATA DUPLIKAT

In [47]:
ibnu = ibnu.copy()

kitacopy datanya agar terduplikat

In [48]:
ibnu = pd.concat([ibnu, ibnu], ignore_index=True)

In [49]:
print("NIlai Duplikat: ")
ibnu.duplicated().sum()

NIlai Duplikat:

45211

menggabungkan data asli dan data duplikat,lalu menampilkan kembali data duplikat nya

In [50]:
ibnu.drop_duplicates(inplace=True)

In [51]:
print("NIlai Duplikat: ")
ibnu.duplicated().sum()

NIlai Duplikat:

0

drop duplikat nya lalu tampilkan ladi data yang sdh nol

DATA CLEANING NILAI NULL

In [52]:
ibnu.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

sudah nol

disini data null saya sudah tidak ada

GANTI TIPE DATA SALAH SATU ATRIBUTE ANGKA

In [53]:
ibnu1['age'] = ibnu1['age'].astype(object)

In [54]:
ibnu1.dtypes

age           object
job           object
marital       object
education     object
default       object
balance      float64
housing       object
loan          object
contact       object
day          float64
month         object
duration     float64
campaign       int64
pdays          int64
previous       int64
poutcome      object
y             object
dtype: object

ganti tipe data "age" menjadi objek

ONE HOT ENCODING

In [64]:
ibnu2 = pd.read_csv('bank-full.csv')

masukkan dataset

In [65]:
ibnu2 [['job', 'marital', 'education']]

                job   marital  education
0        management   married   tertiary
1        technician    single  secondary
2      entrepreneur   married  secondary
3       blue-collar   married    unknown
4           unknown    single    unknown
...             ...       ...        ...
45206    technician   married   tertiary
45207       retired  divorced    primary
45208       retired   married  secondary
45209   blue-collar   married  secondary
45210  entrepreneur   married  secondary

[45211 rows x 3 columns]

cari atribute untuk one hot encoding

In [78]:
hot_ibnu = OneHotEncoder(sparse_output=False)
encoded_ibnu = hot_ibnu.fit_transform(ibnu2[['marital', 'education']])

In [79]:
encoded = pd.DataFrame(encoded_ibnu, columns=['s','m','d','tertiary', 'secondary','unknown','primary']) 
encoded

         s    m    d  tertiary  secondary  unknown  primary
0      0.0  1.0  0.0       0.0        0.0      1.0      0.0
1      0.0  0.0  1.0       0.0        1.0      0.0      0.0
2      0.0  1.0  0.0       0.0        1.0      0.0      0.0
3      0.0  1.0  0.0       0.0        0.0      0.0      1.0
4      0.0  0.0  1.0       0.0        0.0      0.0      1.0
...    ...  ...  ...       ...        ...      ...      ...
45206  0.0  1.0  0.0       0.0        0.0      1.0      0.0
45207  1.0  0.0  0.0       1.0        0.0      0.0      0.0
45208  0.0  1.0  0.0       0.0        1.0      0.0      0.0
45209  0.0  1.0  0.0       0.0        1.0      0.0      0.0
45210  0.0  1.0  0.0       0.0        1.0      0.0      0.0

[45211 rows x 7 columns]

In [80]:
ibnu2 = pd.concat([ibnu2, encoded], axis=1)
ibnu2.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,...,previous,poutcome,y,s,m,d,tertiary,secondary,unknown,primary
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,...,0,unknown,no,0.0,1.0,0.0,0.0,0.0,1.0,0.0
1,44,technician,single,secondary,no,29,yes,no,unknown,5,...,0,unknown,no,0.0,0.0,1.0,0.0,1.0,0.0,0.0
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,...,0,unknown,no,0.0,1.0,0.0,0.0,1.0,0.0,0.0
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,...,0,unknown,no,0.0,1.0,0.0,0.0,0.0,0.0,1.0
4,33,unknown,single,unknown,no,1,no,no,unknown,5,...,0,unknown,no,0.0,0.0,1.0,0.0,0.0,0.0,1.0

In [61]:
ibnu_dummies = pd.get_dummies(ibnu2[['education', 'marital']]).replace(False, 0).replace(True, 1)

In [81]:
ibnu2 = pd.concat([ibnu2, ibnu_dummies], axis=1)

In [82]:
ibnu2.drop(columns=['education', 'marital'], inplace=True)
ibnu2.head()

,age,job,default,balance,housing,loan,contact,day,month,duration,...,secondary,unknown,primary,education_primary,education_secondary,education_tertiary,education_unknown,marital_divorced,marital_married,marital_single
0,58,management,no,2143,yes,no,unknown,5,may,261,...,0.0,1.0,0.0,0,0,1,0,0,1,0
1,44,technician,no,29,yes,no,unknown,5,may,151,...,1.0,0.0,0.0,0,1,0,0,0,0,1
2,33,entrepreneur,no,2,yes,yes,unknown,5,may,76,...,1.0,0.0,0.0,0,1,0,0,0,1,0
3,47,blue-collar,no,1506,yes,no,unknown,5,may,92,...,0.0,0.0,1.0,0,0,0,1,0,1,0
4,33,unknown,no,1,no,no,unknown,5,may,198,...,0.0,0.0,1.0,0,0,0,1,0,0,1

gabungkan data asli dan data hasil one hot encoding lalu tampilkan datanya